tap "crisidev/chunkwm"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "keybase/beta"
tap "koekeishiya/formulae"
tap "michaeldfallen/formula"
tap "neovim/neovim"
cask "xquartz"
# Completion for Atom Package Manager
brew "apm-bash-completion"
# Collection of portable C++ source libraries
brew "boost"
# Standard SGML representation system for technical documents
brew "docbook"
# Formatter/translator for text files to numerous formats. Includes a2x
brew "asciidoc"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Fish completion for brew-cask
brew "brew-cask-completion"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Visually compare two PDF files
brew "diff-pdf"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Portable THreads
brew "pth"
# Server for managing certificate revocation lists
brew "dirmngr"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# GNU Emacs text editor
brew "emacs"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for number theory
brew "flint"
# Command-line fuzzy finder written in Go
brew "fzf"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Command-line option parsing utility
brew "gnu-getopt"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GPG key agent
brew "gpg-agent"
# Automatically generate simple man pages
brew "help2man"
# Generic library support script
brew "libtool"
# JSON parser for C
brew "json-c"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Library for USB device access
brew "libusb"
# Library for USB device access
brew "libusb-compat"
# C library for manipulating Yubico one-time passwords
brew "libyubikey"
# Pipes video from streaming services into a player such as VLC
brew "livestreamer"
# Creates dependencies in makefiles
brew "makedepend"
# Mac App Store command-line interface
brew "mas"
# Multiple Repository management tool
brew "mr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Learn vim commands via a game
brew "pacvim"
# Library to validate YubiKey OTPs against YubiCloud
brew "ykclient"
# YubiKey personalization library and tool
brew "ykpers"
# Yubico pluggable authentication module
brew "pam_yubico"
# Bash completion for Pip
brew "pip-completion"
# Docker Compose compatible client to deploy to Rancher
brew "rancher-compose"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Code-search similar to ack
brew "the_silver_searcher"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Text interface for Git repositories
brew "tig"
# Config manager based on git
brew "vcsh"
# Vi 'workalike' with many additional features
brew "vim"
# Front-end for Task Warrior
brew "vit"
# Internet file retriever
brew "wget"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus", link: false
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Command-line interface to Keybase.io
brew "keybase/beta/keybase", link: false
# Simple hotkey-daemon for OSX.
brew "koekeishiya/formulae/khd"
brew "michaeldfallen/formula/git-radar"
cask "alfred"
cask "amethyst"
cask "angular-console"
cask "appcleaner"
cask "atom"
cask "atom-beta"
cask "beaker-browser"
cask "bettertouchtool"
cask "bisq"
cask "bitwarden"
cask "black-screen"
cask "bragi-updater"
cask "brave"
cask "caffeine"
cask "cakebrew"
cask "ccleaner"
cask "cerebro"
cask "coconutbattery"
cask "daisydisk"
cask "deluge"
cask "discord"
cask "dropbox"
cask "eclipse-java"
cask "electrum"
cask "etcher"
cask "exodus"
cask "firefox"
cask "firefox-developer-edition"
cask "flux"
cask "font-fira-code"
cask "freeter"
cask "github"
cask "githubpulse"
cask "gitkraken"
cask "google-backup-and-sync"
cask "gpg-suite"
cask "gpodder"
cask "hyper"
cask "itsycal"
cask "jaxx"
cask "jaxx-liberty"
cask "jdiskreport"
cask "karabiner-elements"
cask "keybase"
cask "kitematic"
cask "loading"
cask "patchwork"
cask "plex-media-player"
cask "polymail"
cask "resilio-sync"
cask "riot"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "spotify-notifications"
cask "steam"
cask "swift-explorer"
cask "taskwarrior-pomodoro"
cask "the-unarchiver"
cask "tunnelblick"
cask "ubersicht"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "vnc-viewer"
cask "xtrafinder"
cask "yubikey-neo-manager"
cask "yubikey-personalization-gui"
cask "yubikey-piv-manager"
cask "yubiswitch"
mas "2Do", id: 477670270
mas "Airmail", id: 918858936
mas "Bitcoin Ticker - Kraken", id: 858785280
mas "CoinBar", id: 957162288
mas "Dash", id: 458034879
mas "Display Menu", id: 549083868
mas "feedly", id: 865500966
mas "GhosteryLite", id: 1436953057
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LastPass", id: 926036361
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Reeder", id: 880001334
mas "Todoist", id: 585829637
mas "Toodledo", id: 865407053
mas "Trello", id: 1278508951
mas "Twitter", id: 409789998
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
