tap "crisidev/chunkwm"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "keybase/beta"
tap "koekeishiya/formulae"
tap "michaeldfallen/formula"
tap "mistertea/et"
tap "neovim/neovim"
tap "railwaycat/emacsmacport"
# Completion for Atom Package Manager
brew "apm-bash-completion"
# Collection of portable C++ source libraries
brew "boost"
# Formatter/translator for text files to numerous formats. Includes a2x
brew "asciidoc"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion", link: false
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Informative, fancy bash prompt for Git users
brew "bash-git-prompt"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Libraries for security-enabled client and server applications
brew "nss"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Visually compare two PDF files
brew "diff-pdf"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# GNU Portable THreads
brew "pth"
# Server for managing certificate revocation lists
brew "dirmngr"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# X11 image viewer
brew "feh"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for number theory
brew "flint"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GPG key agent
brew "gpg-agent"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Automatically generate simple man pages
brew "help2man"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick@6"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser for C
brew "json-c"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Library for USB device access
brew "libusb"
# Library for USB device access
brew "libusb-compat"
# C library for manipulating Yubico one-time passwords
brew "libyubikey"
# Pipes video from streaming services into a player such as VLC
brew "livestreamer"
# Run LogQL queries against a Loki server
brew "logcli"
# Creates dependencies in makefiles
brew "makedepend"
# Mac App Store command-line interface
brew "mas"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Multiple Repository management tool
brew "mr"
# DNS benchmark utility
brew "namebench"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Kubernetes introspection tool for developers
brew "octant"
# Learn vim commands via a game
brew "pacvim"
# Library to validate YubiKey OTPs against YubiCloud
brew "ykclient"
# YubiKey personalization library and tool
brew "ykpers"
# Yubico pluggable authentication module
brew "pam_yubico"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Display the PID number for a given process name
brew "pidof"
# Bash completion for Pip
brew "pip-completion"
# Show ps output as a tree
brew "pstree"
# Docker Compose compatible client to deploy to Rancher
brew "rancher-compose"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Command-line Reddit client
brew "rtv"
# Safe, concurrent, practical language
brew "rust"
# Git-integrated backup tool for macOS and Linux devs
brew "shallow-backup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Version control system designed to be a better CVS
brew "subversion"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Code-search similar to ack
brew "the_silver_searcher"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Config manager based on git
brew "vcsh"
# Vi 'workalike' with many additional features
brew "vim"
# Full-screen terminal interface for Taskwarrior
brew "vit"
# Extensible IRC client
brew "weechat"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Command-line interface to Keybase.io
brew "keybase/beta/keybase", link: false
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
brew "michaeldfallen/formula/git-radar"
# Remote terminal with IP roaming
brew "mistertea/et/et"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac"
cask "aether"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
cask "angular-console"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Text editor
cask "atom"
# Experimental peer-to-peer web browser
cask "beaker-browser"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Decentralized bitcoin exchange network
cask "bisq"
# Utility to display the output from any script or program in the menu bar
cask "bitbar"
# Desktop password and login vault
cask "bitwarden"
cask "black-screen"
cask "bragi-updater"
cask "brave"
# Utility that prevents the system from going to sleep
cask "caffeine"
# GUI app for Homebrew
cask "cakebrew"
cask "ccleaner"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Disk space visualizer
cask "daisydisk"
# BitTorrent client
cask "deluge"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "eclipse-java"
# Desktop remote torrenting application
cask "electorrent"
# Bitcoin thin client
cask "electrum"
cask "etcher"
# Desktop wallet for cryptocurrency assets
cask "exodus"
# Web browser
cask "firefox-beta"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "firefox-nightly"
# Screen color temperature controller
cask "flux"
cask "font-awesome-terminal-fonts"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-for-powerline"
# Icon set and toolkit
cask "font-fontawesome"
cask "freeter"
# Desktop client for GitHub repositories
cask "github"
# Git client focusing on productivity
cask "gitkraken"
cask "google-backup-and-sync"
# Tools to protect your emails and files
cask "gpg-suite"
# Podcast client
cask "gpodder"
# Terminal built on web technologies
cask "hyper"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta"
# Menu bar calendar
cask "itsycal"
cask "jaxx"
cask "jaxx-liberty"
cask "jdiskreport"
# End-to-end encryption software
cask "keybase"
# Visual user interface for Docker Container management
cask "kitematic"
cask "loading"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
cask "openbazaar"
cask "patchwork"
# Home media server
cask "plex"
# Music player focusing on visuals
cask "plexamp"
cask "polymail"
# Professional IDE for scientific and web Python development
cask "pycharm-edu"
# IRC client
cask "quassel"
# File sync and share software
cask "resilio-sync"
cask "riot"
cask "seaglass"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
cask "spotify-notifications"
# Video game digital distribution service
cask "steam"
cask "swift-explorer"
# Back up files to a centralized Synology NAS
cask "synology-cloud-station-backup"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
cask "taskwarrior-pomodoro"
# Unpacks archive files
cask "the-unarchiver"
# Customizable email client
cask "thunderbird"
cask "tunnelblick"
# Run commands and display their output on the desktop
cask "ubersicht"
# Development environment
cask "vagrant"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
cask "x2goclient"
# Open-source version of the X.Org X Window System
cask "xquartz"
cask "yubikey-neo-manager"
cask "yubikey-personalization-gui"
cask "yubikey-piv-manager"
cask "yubiswitch"
# Open-source markdown editor
cask "zettlr"
# Video communication and virtual meeting platform
cask "zoom"
mas "2Do", id: 477670270
mas "Airmail", id: 918858936
mas "Canary Mail", id: 1236045954
mas "CoinBar", id: 957162288
mas "Dash", id: 458034879
mas "Display Menu", id: 549083868
mas "feedly", id: 865500966
mas "Kindle", id: 405399194
mas "LastPass", id: 926036361
mas "LimeChat", id: 414030210
mas "Pocket", id: 568494494
mas "Reeder", id: 880001334
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
mas "Twitter", id: 409789998
mas "WireGuard", id: 1451685025
mas "Wunderlist", id: 410628904
mas "Xcode", id: 497799835
